"""7. Реализовать генератор с помощью функции с ключевым словом yield, создающим
очередное значение. При вызове функции должен создаваться объект-генератор. Функция
должна вызываться следующим образом: for el in fact(n). Функция отвечает за
получение факториала числа, а в цикле необходимо выводить только первые n чисел,
начиная с 1! и до n!.
Подсказка: факториал числа n — произведение чисел от 1 до n. Например, факториал
четырёх 4! = 1 * 2 * 3 * 4 = 24.
"""


def fact(n):
    """Возвращает генератор факториала от 1 до введеного числа
    Именованные параметры:
    :n: -- конечное число
    """
    mult = 1
    for itm in range(1, n + 1):
        mult = itm * mult
        yield mult

cnt = 5
for itm in fact(cnt):
    print(itm)
